-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 23, 2024 at 11:24 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `webproject`
--

-- --------------------------------------------------------

--
-- Table structure for table `interests`
--

CREATE TABLE `interests` (
  `id` int(11) NOT NULL,
  `userId` int(11) NOT NULL,
  `presentationId` int(11) NOT NULL,
  `interestType` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `interests`
--

INSERT INTO `interests` (`id`, `userId`, `presentationId`, `interestType`) VALUES
(1, 2, 1, '2'),
(2, 2, 2, '1'),
(3, 2, 3, '4'),
(4, 2, 5, '1'),
(5, 2, 6, '2');

-- --------------------------------------------------------

--
-- Table structure for table `presentations`
--

CREATE TABLE `presentations` (
  `id` int(11) NOT NULL,
  `orderId` int(11) NOT NULL,
  `date` date NOT NULL,
  `hour` varchar(8) NOT NULL,
  `fn` varchar(20) NOT NULL,
  `groupStudent` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `topicId` int(11) DEFAULT NULL,
  `topic` varchar(90) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `presentations`
--

INSERT INTO `presentations` (`id`, `orderId`, `date`, `hour`, `fn`, `groupStudent`, `name`, `topicId`, `topic`) VALUES
(1, 1, '2023-12-20', '08:15', '81807', 1, 'Даниел Туечки', 65, 'ReactJS'),
(2, 2, '2023-12-20', '08:23', '82184', 3, 'Венета Кирева', 1, '\"HTML5 - част 1 семантични тагове, тагове за форми. Примери.\"'),
(3, 3, '2023-12-20', '08:31', '81478', 2, 'Константин Терзиев', 75, 'Споделяне на ресурси от различни източници (CORS). Примери.'),
(4, 4, '2023-12-20', '08:39', '82140', 1, 'Диана Маркова', 9, '\"DOM дърво, обхождане и манипулация\"'),
(5, 5, '2023-12-20', '08:47', '82214', 2, 'Петър Колев', 81, 'Progressive Web Apps (PWAs)'),
(6, 6, '2023-12-20', '09:15', '82019', 1, 'Владимир Тошев', 8, 'Новости в PHP 8+'),
(7, 7, '2023-12-20', '09:23', '9MI0600004', 0, 'Божидар Абаджиев', 15, 'Svelte'),
(8, 8, '2023-12-20', '09:31', '82152', 2, 'Ралица Трендафилова', 173, 'Дефиниция на свършената работа в SCRUM и приложението й в уеб проектите'),
(9, 9, '2023-12-20', '09:39', '82071', 6, 'Ирина Христова', 85, 'Micro Frontends'),
(10, 10, '2023-12-20', '09:47', '82061', 6, 'Йордан Косев', 111, 'Софтуерни шаблони за създаване (в php)'),
(11, 11, '2023-12-20', '11:15', '82303', 6, 'Ана Илиева', 3, '\"CSS: стилове, класове, селектори\"'),
(12, 12, '2023-12-20', '11:23', '82284', 6, 'Владимир Стоянов', 54, '\"Nginx. Архитектура, инсталиране, конфигуриране, виртуални хостове\"'),
(13, 13, '2023-12-20', '11:31', '82115', 1, 'Стефани Стефанова', 22, 'CSS Модули и Съвместим CSS'),
(14, 14, '2023-12-20', '11:39', '81944', 2, 'Найден Найденов', 150, 'WebXR'),
(15, 15, '2023-12-20', '11:47', '82217', 5, 'Антъни Господинов', 34, 'Високопроизводителни анимации в уеб'),
(16, 16, '2023-12-20', '12:15', '82126', 1, 'Борислав Минчев', 147, 'Добри практики в PHP. Примери'),
(17, 17, '2023-12-20', '12:23', '82211', 2, 'Ангел Петров', 57, 'Apollo GraphQL'),
(18, 18, '2023-12-20', '12:31', '82213', 2, 'Соня Николова', 120, 'TypeScript'),
(19, 19, '2023-12-20', '12:39', '82161', 2, 'Панайот Маринов', 10, 'Работа със сесии и cookies (от страна насървъра и клиента). Local Storage API'),
(20, 20, '2023-12-20', '12:47', '81511', 2, 'Димитър Иванов', 90, 'Web Performance Timing APIs'),
(21, 1, '2024-01-03', '08:15', '82260', 6, 'Николай Тодоров', 170, 'Microservices/Микроуслуги'),
(22, 2, '2024-01-03', '08:23', '82246', 6, 'Рени Коруева', 17, 'Използване на Git за уеб разработка-добри практики'),
(23, 3, '2024-01-03', '08:31', '82142', 1, 'Чудомир Ченков', 117, 'Стартиране на LAMP приложение посредством Kubernetes'),
(24, 4, '2024-01-03', '08:39', '82275', 7, 'Стойчо Кьосев', 0, ''),
(25, 5, '2024-01-03', '08:47', '82139', 1, 'Иван Михов', 46, 'Изграждане на 3д в уеб'),
(26, 6, '2024-01-03', '09:15', '82205', 3, 'Йоана Дудева', 42, 'Обектно-ориентиран CSS'),
(27, 7, '2024-01-03', '09:23', '82133', 1, 'Карина Христова', 115, '\"Създаване на диаграми с chartjs. Примери, добри практики. Видове диаграми.\"'),
(28, 8, '2024-01-03', '09:31', '82176', 3, 'Румен Азманов', 112, 'Софтуерни шаблони; структурни (в php)'),
(29, 9, '2024-01-03', '09:39', '82236', 5, 'Тодор Митрев', 162, 'Малко популярни тагове в HTML'),
(30, 10, '2024-01-03', '09:47', '82158', 2, 'Христо Жаблянов', 84, 'Imba'),
(31, 11, '2024-01-03', '11:15', '82302', 6, 'Велизар Зарков', 0, ''),
(32, 12, '2024-01-03', '11:23', '', 0, '', 0, ''),
(33, 13, '2024-01-03', '11:31', '82243', 6, 'Аристотелис Папанис', 82, 'WASM'),
(34, 14, '2024-01-03', '11:39', '82150', 2, 'Петър Петров ', 16, 'Fetch API / XHR'),
(35, 15, '2024-01-03', '11:47', '82231', 5, 'Вероника Попова', 99, 'Опълномощаване с OAuth2 (authorization)'),
(36, 16, '2024-01-03', '12:15', '82189', 3, 'Цветомир Младенов', 0, ''),
(37, 17, '2024-01-03', '12:23', '81916', 6, 'Мая Симеонова', 0, ''),
(38, 18, '2024-01-03', '12:31', '82185', 3, 'Веселин Ангелов', 2, 'LaTeX - сравнение с HTML'),
(39, 19, '2024-01-03', '12:39', '82186', 3, 'Васил Василев', 171, 'Добавяне на React към уеб сайт'),
(40, 20, '2024-01-03', '12:47', '82218', 5, 'Щилиян Бончев', 106, 'Уязвимости в уеб приложения - XSS - изпълнение на външни скриптове (OWASP-A7)'),
(41, 1, '2024-01-10', '08:15', '82084', 1, 'Цанко Ангелов', 67, 'ECMAScript 2016/6/ ES 7+'),
(42, 2, '2024-01-10', '08:23', '82141', 1, 'Алекс Йорданов', 31, 'CSS Shapes'),
(43, 3, '2024-01-10', '08:31', '82129', 1, 'Васил Тодоров', 0, 'PHP 7+ (новости спрямо 5+)'),
(44, 4, '2024-01-10', '08:39', '82127', 1, 'Димитър Ангелов', 138, 'Frontend интернационализация на уеб приложения'),
(45, 5, '2024-01-10', '08:47', '81921', 2, 'Андрей Йорданов', 0, ''),
(46, 6, '2024-01-10', '09:15', '82201', 2, 'Силвия Петрова', 0, ''),
(47, 7, '2024-01-10', '09:23', '82165', 2, 'Георги Хърлев', 0, ''),
(48, 8, '2024-01-10', '09:31', '', 0, '', 0, ''),
(49, 9, '2024-01-10', '09:39', '', 0, '', 0, ''),
(50, 10, '2024-01-10', '09:47', '82234', 5, 'Мартин Дачев', 166, 'Достъпност в уеб'),
(51, 11, '2024-01-10', '11:15', '82130', 1, 'Цветелин Костадинов', 0, 'Jenkins Pipeline'),
(52, 12, '2024-01-10', '11:23', '82173', 3, 'Елизабет Великова', 186, 'Изграждане на дизайн за сгъваеми устройства с два екрана'),
(53, 13, '2024-01-10', '11:31', '82134', 1, 'Мартин Попов', 78, '\"JSON Web Token (JWT), JSON Web Signature (JWS), JSON Web Encryption (JWE), JSON Web Algor'),
(54, 14, '2024-01-10', '11:39', '', 0, '', 0, ''),
(55, 15, '2024-01-10', '11:47', '82219', 5, 'Димо Чанев', 58, 'Web Workers'),
(56, 16, '2024-01-10', '12:15', '82190', 3, 'Михаил Сашков', 0, ''),
(57, 17, '2024-01-10', '12:23', '82198', 2, 'Александър Костадинов', 100, 'Уязвимости в уеб приложения - инжекции (OWASP-A1). ​'),
(58, 18, '2024-01-10', '12:31', '82157', 0, '', 0, ''),
(59, 19, '2024-01-10', '12:39', '82193', 3, 'Емил Йорданов', 20, 'Selenium WebDriver'),
(60, 20, '2024-01-10', '12:47', '81948', 7, 'Хиндату Сани', 52, 'MongoDB за уеб приложения. MEAN стек.'),
(61, 1, '2024-01-17', '08:15', '82164', 2, 'Иван Стефанов', 25, 'URL Rewriting\r'),
(62, 2, '2024-01-17', '08:23', '82154', 2, 'Радослав Иванов', 0, '\r'),
(63, 3, '2024-01-17', '08:31', '82197', 1, 'Любен Георгиев', 0, '\r'),
(64, 4, '2024-01-17', '08:39', '81768', 2, 'Мартин Каменов', 43, 'HTTPS и HTTP - сигурност в PHP\r'),
(65, 5, '2024-01-17', '08:47', '82232', 5, 'Цветелина Илиева', 0, '\r'),
(66, 6, '2024-01-17', '09:15', '82159', 2, 'Йордан Йорданов', 33, 'Тестване с Jestjs\r'),
(67, 7, '2024-01-17', '09:23', '82103', 7, 'Тодор Кюркчиев ', 5, '\"CSS Layouts, Flexbox\"\r'),
(68, 8, '2024-01-17', '09:31', '82005', 1, 'Арександър Кунев', 55, 'Apache\r'),
(69, 9, '2024-01-17', '09:39', '82169', 2, 'Кристиян Георгиев', 125, 'Използване на SVG в уеб \r'),
(70, 10, '2024-01-17', '09:47', '82167', 2, 'Владимир Илиев', 72, 'Hypertext Transfer Protocol (HTTP/1.1): Authentication\r'),
(71, 11, '2024-01-17', '11:15', '82038', 1, 'Павел Григоров', 29, 'Styled JSX\r'),
(72, 12, '2024-01-17', '11:23', '82248', 3, 'Мартин Йорданов', 174, 'Лоши практики в уеб приложенията\r'),
(73, 13, '2024-01-17', '11:31', '82191', 3, 'Божидар Иванов', 87, 'WebExtensions - разширения за firefox\r'),
(74, 14, '2024-01-17', '11:39', '82157', 2, 'Адриян Ибовски', 12, 'HTTP2\r'),
(75, 15, '2024-01-17', '11:47', '82162', 2, 'Тодор Христов', 141, ' Session and state management in ASP.NET Core\r'),
(76, 16, '2024-01-17', '12:15', '82174', 3, 'Александър Банков ', 101, 'Уязвимости в уеб приложения - дефектна аутентикация\r'),
(77, 17, '2024-01-17', '12:23', '82238', 5, 'Михаил Минков ', 107, 'Уязвимости в уеб приложения - несигурна десериализация\r'),
(78, 18, '2024-01-17', '12:31', '82207', 2, 'Николай Мъглов', 13, '\r'),
(79, 19, '2024-01-17', '12:39', '82155', 2, 'Пламен Динев', 63, 'Jekyll\r'),
(80, 20, '2024-01-17', '12:47', '', 0, '', 0, '\r');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `userId` int(11) NOT NULL,
  `fn` varchar(20) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(99) NOT NULL,
  `admin` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`userId`, `fn`, `username`, `password`, `admin`) VALUES
(1, '00001', 'admin1', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 1),
(2, '88888', 'user1', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 0),
(6, '82245', 'user2', 'f4e98344541784f2eabcf6fcd1daf050afd9a1bfa2c59819356fe0543752f311', 0),
(7, '82245', 'user3', 'f4e98344541784f2eabcf6fcd1daf050afd9a1bfa2c59819356fe0543752f311', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `interests`
--
ALTER TABLE `interests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `presentations`
--
ALTER TABLE `presentations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`userId`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `interests`
--
ALTER TABLE `interests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `presentations`
--
ALTER TABLE `presentations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `userId` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
